modules/swanemacs-mail-news.org
#+TITLE: SwanEmacs email and news settings
#+AUTHOR: Anthony Le Cigne

* Table of contents                                            :toc:noexport:
- [[#elfeed][Elfeed]]
- [[#wrapping-up][Wrapping up]]

* Elfeed

#+begin_src emacs-lisp :tangle yes
  (use-package elfeed
    :ensure   t
    :commands elfeed
    :config
    (setq elfeed-feeds
            '("https://news.ycombinator.com/rss"
              ("https://www.reddit.com/r/emacs/.rss" emacs)
              ("http://sachachua.com/blog/category/emacs-news/feed" emacs)
              ("http://endlessparentheses.com/atom.xml" emacs)
              ("http://www.masteringemacs.org/feed/" emacs)
              ("http://emacs-fu.blogspot.com/feeds/posts/default" emacs)
              ("http://emacsredux.com/atom.xml" emacs)
              ("http://emacshorrors.com/feed.atom" emacs)
              ("http://pragmaticemacs.com/feed/" emacs))
            elfeed-search-filter ""))
#+end_src

* Wrapping up

#+begin_src emacs-lisp :tangle yes
  (provide 'swanemacs-mail-news)
#+end_src
